app/helpers/publications_helper.rb

  def promedio(id)
    reviews = Publication.find_by(id: id).reviews.pluck(:review)
    @sumatoria = reviews.sum
---
SELECT "reviews"."review" FROM "reviews" WHERE "reviews"."publication_id" = $1  [["publication_id", 1]]
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]