app/helpers/reviews_helper.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
UPDATE "reviews" SET "review" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["review", 1], ["updated_at", "2022-11-10 20:44:19.159382"], ["id", 1]]
---
  def hello_world(new_data)
    Review.find_by(user_id: current_user).update(review: new_data)