app/controllers/pivots_controller.rb

  def index
    @pivots = Pivot.all
---
SELECT "pivots".* FROM "pivots"

  def create
    @user_moderator_id = rand(User.where(moderator: true).all.count)
    @pivot = Pivot.new(pivot_params)

    @pivot.user_id = current_user.id
    @pivot.moderador_id = User.where(moderator: true).offset(@user_moderator_id).first.id

    respond_to do |format|
      if @pivot.save
---
SELECT COUNT(*) FROM "users" WHERE "users"."moderator" = $1  [["moderator", true]]
SELECT "users".* FROM "users" WHERE "users"."moderator" = $1 ORDER BY "users"."id" ASC LIMIT $2 OFFSET $3  [["moderator", true], ["LIMIT", 1], ["OFFSET", 0]]
INSERT INTO "pivots" ("user_id", "club_name", "sport_name", "moderador_id", "club_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @pivot.update(pivot_params)
---
UPDATE "pivots" SET "status" = $1, "updated_at" = $2 WHERE "pivots"."id" = $3  [["status", "accepted"], ["updated_at", "2022-11-10 20:28:52.466732"], ["id", 1]]

  def set_pivot
    @pivot = Pivot.find(params[:id])
---
SELECT "pivots".* FROM "pivots" WHERE "pivots"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]