app/controllers/publications_controller.rb

SELECT "publications".* FROM "publications" WHERE "publications"."sport_name" = $1  [["sport_name", "Padel"]]
SELECT "publications".* FROM "publications"
---
  def index
    @publications = if params[:sport_name]
                      Publication.where(sport_name: params[:sport_name])
                    else
                      Publication.all

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @publication = Publication.find(params[:id])

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "publications" WHERE "publications"."id" = $1  [["id", 1]]
---
  def destroy
    @publication = Publication.find(params[:id])
    @publication.destroy

INSERT INTO "publications" ("club_name", "club_address", "sport_name", "user_id", "created_at", "updated_at", "imageurl") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @publication = Publication.new(publications_params)
    @publication.user_id = current_user.id
    if @publication.save