app/controllers/responses_controller.rb

  def index
    @responses = end
    Response.all
---
SELECT "responses".* FROM "responses"

  def create
    @response = Response.new(response_params)
    @response.user_id = session[:user_id]
    @response.user_moderator = session[:user_moderator]
    @response.message_for = @response.user_id if current_user.moderator == true
    @response.message_for = @response.user_moderator unless current_user.moderator == true

    redirect_to responses_path if @response.save
---
INSERT INTO "responses" ("message", "user_id", "user_moderator", "created_at", "updated_at", "message_for") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["message", "mensaje a moderador"], ["user_id", 3], ["user_moderator", 2], ["created_at", "2022-11-10 20:19:51.810374"], ["updated_at", "2022-11-10 20:19:51.810374"], ["message_for", 2]]