app/controllers/reviews_controller.rb

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @publication = Publication.find(params[:publication_id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("publication_id", "review", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["publication_id", 1], ["review", 5], ["created_at", "2022-11-10 20:44:15.017092"], ["updated_at", "2022-11-10 20:44:15.017092"], ["user_id", 4]]
---
  def create
    # Encontramos usuario en publicacion?
    if Review.find_by(user_id: current_user.id).present?
      # Actualizamos el review
      hello_world(params[:review][:review].to_i)
      redirect_to root_path
    else
      @publication = Publication.find(params[:publication_id])
      @review = @publication.reviews.build(reviews_params)
      @review.user_id = current_user.id
      redirect_to root_path if @review.save